# Konversi nilai numerik ke dalam sejumlah kategori

# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.4
1.26.4

# Persiapan Data Frame

In [2]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), 
                  columns=cols)
df

   usia
0    75
1    68
2    89
3    85
4    44
5    55
6    76
7    94
8    35
9    96

# Pengelompokkan nilai numerik ke dalam beberapa kategori menggunakan cut()

In [3]:
df['kelompok_usia'] = pd.cut(df['usia'], 
                             bins=[0, 18, 65, 99], 
                             labels=['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0    75        manula
1    68        manula
2    89        manula
3    85        manula
4    44        dewasa
5    55        dewasa
6    76        manula
7    94        manula
8    35        dewasa
9    96        manula